package com.lzw;

import java.util.LinkedHashMap;
import java.util.Map;

public class CityMap {
    /**
     * 全國（省，直轄市，自治區）映射集合
     */
    public static Map<String,String[]> model=new LinkedHashMap();
    static{
        model.put("北京", new String[]{"北京"});
        model.put("上海", new String[]{"上海"});
        model.put("天津", new String[]{"天津"});
        model.put("重慶", new String[]{"重慶"});
        model.put("黑龍江", new String[]{"哈爾濱","齊齊哈爾","牡丹江","大慶","伊春","雙鴨山","鶴崗","雞西","佳木斯","七台河","黑河","綏化","大興安嶺"});
        model.put("吉林", new String[]{"長春","延邊","吉林","白山","白城","四平","松原","遼源","大安","通化"});
        model.put("遼寧", new String[]{"瀋陽","大連","葫蘆島","旅順","本溪","撫順","鐵嶺","遼陽","營口","阜新","朝陽","錦州","丹東","鞍山"});
        model.put("內蒙古", new String[]{"呼和浩特","呼倫貝爾","錫林浩特","包頭","赤峰","海拉爾","烏海","鄂爾多斯","通遼"});
        model.put("河北", new String[]{"石家莊","唐山","張家口","廊坊","邢台","邯鄲","滄州","衡水","承德","保定","秦皇島"});
        model.put("河南", new String[]{"鄭州","開封","洛陽","平頂山","焦作","鶴壁","新鄉","安陽","濮陽","許昌","漯河","三門峽","南陽","商丘","信陽","周口","駐馬店"});
        model.put("山東", new String[]{"濟南","青島","淄博","威海","曲阜","臨沂","煙台","棗莊","聊城","濟寧","菏澤","泰安","日照","東營","德州","濱州","萊蕪","濰坊"});
        model.put("山西", new String[]{"太原","陽泉","晉城","晉中","臨汾","運城","長治","朔州","忻州","大同","呂梁"});
        model.put("江蘇", new String[]{"南京","蘇州","昆山","南通","太倉","吳縣","徐州","宜興","鎮江","淮安","常熟","鹽城","泰州","無錫","連雲港","揚州","常州","宿遷"});
        model.put("安徽", new String[]{"合肥","巢湖","蚌埠","安慶","六安","滁州","馬鞍山","阜陽","宣城","銅陵","淮北","蕪湖","毫州","宿州","淮南","池州"});
        model.put("陝西", new String[]{"西安","韓城","安康","漢中","寶雞","咸陽","榆林","渭南","商洛","銅川","延安"});
        model.put("寧夏", new String[]{"銀川","固原","中衛","石嘴山","吳忠"});
        model.put("甘肅", new String[]{"蘭州","白銀","慶陽","酒泉","天水","武威","張掖","甘南","臨夏","平涼","定西","金昌"});
        model.put("青海", new String[]{"西寧","海北","海西","黃南","果洛","玉樹","海東","海南"});
        model.put("湖北", new String[]{"武漢","宜昌","黃岡","恩施","荊州","神農架","十堰","咸寧","襄樊","孝感","隨州","黃石","荊門","鄂州"});
        model.put("湖南", new String[]{"長沙","邵陽","常德","郴州","吉首","株洲","婁底","湘潭","益陽","永州","岳陽","衡陽","懷化","韶山","張家界"});
        model.put("浙江", new String[]{"杭州","湖州","金華","寧波","麗水","紹興","雁蕩山","衢州","嘉興","台州","舟山","溫州"});
        model.put("江西", new String[]{"南昌","萍鄉","九江","上饒","撫州","吉安","鷹潭","宜春","新余","景德鎮","贛州"});
        model.put("福建", new String[]{"福州","廈門","龍巖","南平","寧德","莆田","泉州","三明","漳州"});
        model.put("貴州", new String[]{"貴陽","安順","赤水","遵義","銅仁","六碟水","畢節","凱裡","都勻"});
        model.put("四川", new String[]{"成都","瀘州","內江","涼山","阿壩","巴中","廣元","樂山","綿陽","德陽","攀枝花","雅安","宜賓","自貢","甘孜州","達州","資陽","廣安","遂寧","眉山","南充"});
        model.put("廣東", new String[]{"廣州","深圳","潮州","韶關","湛江","惠州","清遠","東莞","江門","茂名","肇慶","汕尾","河源","揭陽","梅州","中山","德慶","陽江","雲浮","珠海","汕頭","佛山"});
        model.put("廣西", new String[]{"南寧","桂林","陽朔","柳州","梧州","玉林","桂平","賀州","欽州","貴港","防城港","百色","北海","河池","來賓","崇左"});
        model.put("雲南", new String[]{"昆明","保山","楚雄","德巨集","紅河","臨滄","怒江","曲靖","思茅","文山","玉溪","昭通","麗江","大理"});
        model.put("海南", new String[]{"海口","三亞","儋州","瓊山","通什","文昌"});
        model.put("新疆", new String[]{"烏魯木齊","阿勒泰","阿克蘇","昌吉","哈密","和田","喀什","克拉瑪依","石河子","塔城","函數庫爾勒","吐魯番","伊寧"});
    }
}
